In [4]:
import pandas as pd 
import numpy as np
import json
import ast
import sqlite3 as sq3

In [7]:
db = sq3.connect('aims.db')

In [8]:
df = pd.read_json("In-Class.json", orient='split')

In [9]:
df.head(3)

,title,id,revenue,genres,belongs_to_collection,runtime
0,Avengers: Endgame,299534,2797800564,"[{'id': 12, 'name': 'Adventure'}, {'id': 878, ...","{'id': 86311, 'name': 'The Avengers Collection...",181
1,Avatar,19995,2787965087,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...","{'id': 87096, 'name': 'Avatar Collection', 'po...",162
2,Star Wars: The Force Awakens,140607,2068223624,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...","{'id': 10, 'name': 'Star Wars Collection', 'po...",136

<h1 style = "color: cornflowerblue"> Create a dataframe Title and assign it to id and title from the main df</h1>

In [10]:
title = df[['id', 'title']]

In [11]:
title.head(2)

       id              title
0  299534  Avengers: Endgame
1   19995             Avatar

<h1 style = "color: cornflowerblue"> Create a dataframe Revenue and assign it to id and revenue from the main df</h1>

In [12]:
revenue = df[['id', 'revenue']]

In [13]:
revenue.head(2)

       id     revenue
0  299534  2797800564
1   19995  2787965087

In [14]:
df.genres[0]

[{'id': 12, 'name': 'Adventure'},
 {'id': 878, 'name': 'Science Fiction'},
 {'id': 28, 'name': 'Action'}]

<h1 style="color: red"> Separate the Names in the Genres and assign to a variable Genre</h1>

In [16]:
Genre = df.genres.apply(lambda x: '||'.join(i['name'] for i in x))

In [18]:
Genre.head(2)

0             Adventure||Science Fiction||Action
1    Action||Adventure||Fantasy||Science Fiction
Name: genres, dtype: object

In [19]:
df.head()

,title,id,revenue,genres,belongs_to_collection,runtime
0,Avengers: Endgame,299534,2797800564,"[{'id': 12, 'name': 'Adventure'}, {'id': 878, ...","{'id': 86311, 'name': 'The Avengers Collection...",181
1,Avatar,19995,2787965087,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...","{'id': 87096, 'name': 'Avatar Collection', 'po...",162
2,Star Wars: The Force Awakens,140607,2068223624,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...","{'id': 10, 'name': 'Star Wars Collection', 'po...",136
3,Avengers: Infinity War,299536,2046239637,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...","{'id': 86311, 'name': 'The Avengers Collection...",149
4,Titanic,597,1845034188,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",None,194

0    {'id': 86311, 'name': 'The Avengers Collection...
1    {'id': 87096, 'name': 'Avatar Collection', 'po...
Name: belongs_to_collection, dtype: object

In [21]:
type(df.belongs_to_collection)

pandas.core.series.Series

In [41]:
belongs = df.belongs_to_collection.to_dict()

In [42]:
belongs = pd.DataFrame(belongs).T

In [48]:
belongs.head(2)

,backdrop_path,belongs_to_id,name,poster_path
0,/zuW6fOiusv4X9nnW3paHGfXcSll.jpg,86311,The Avengers Collection,/yFSIUVTCvgYrpalUktulvk3Gi5Y.jpg
1,/8nCr9W7sKus2q9PLbYsnT7iCkuT.jpg,87096,Avatar Collection,/nslJVsO58Etqkk17oXMuVK4gNOF.jpg

In [47]:
belongs.rename(columns = {'id':'belongs_to_id'}, inplace=True)

In [49]:
belongs['id'] =df.id

In [50]:
belongs.head(2)

,backdrop_path,belongs_to_id,name,poster_path,id
0,/zuW6fOiusv4X9nnW3paHGfXcSll.jpg,86311,The Avengers Collection,/yFSIUVTCvgYrpalUktulvk3Gi5Y.jpg,299534
1,/8nCr9W7sKus2q9PLbYsnT7iCkuT.jpg,87096,Avatar Collection,/nslJVsO58Etqkk17oXMuVK4gNOF.jpg,19995

In [54]:
new_columns = ['id','belongs_to_id', 'name', 'poster_path','backdrop_path']

In [55]:
belongs = belongs[new_columns]

In [56]:
belongs.head(2)

,id,belongs_to_id,name,poster_path,backdrop_path
0,299534,86311,The Avengers Collection,/yFSIUVTCvgYrpalUktulvk3Gi5Y.jpg,/zuW6fOiusv4X9nnW3paHGfXcSll.jpg
1,19995,87096,Avatar Collection,/nslJVsO58Etqkk17oXMuVK4gNOF.jpg,/8nCr9W7sKus2q9PLbYsnT7iCkuT.jpg

In [63]:
title.to_sql('Title', db, if_exists='replace', index = False)

In [64]:
revenue.to_sql('Revenue', db, if_exists='replace', index = False)

In [65]:
Genre.to_sql('Genre', db, if_exists='replace', index = False)

In [66]:
belongs.to_sql('Belongs_to_Collection', db, if_exists='replace', index = False)

In [70]:
db.execute('SELECT * FROM sqlite_master').fetchall()

[('table',
  'Title',
  'Title',
  2,
  'CREATE TABLE "Title" (\n"id" INTEGER,\n  "title" TEXT\n)'),
 ('table',
  'Revenue',
  'Revenue',
  3,
  'CREATE TABLE "Revenue" (\n"id" INTEGER,\n  "revenue" INTEGER\n)'),
 ('table', 'Genre', 'Genre', 4, 'CREATE TABLE "Genre" (\n"genres" TEXT\n)'),
 ('table',
  'Belongs_to_Collection',
  'Belongs_to_Collection',
  5,
  'CREATE TABLE "Belongs_to_Collection" (\n"id" INTEGER,\n  "belongs_to_id" INTEGER,\n  "name" TEXT,\n  "poster_path" TEXT,\n  "backdrop_path" TEXT\n)')]

In [72]:
db.execute('SELECT name FROM sqlite_master WHERE type="table" ').fetchall()

[('Title',), ('Revenue',), ('Genre',), ('Belongs_to_Collection',)]

In [75]:
pd.read_sql('SELECT * FROM  Title ', db).head(2)

       id              title
0  299534  Avengers: Endgame
1   19995             Avatar

In [78]:
pd.read_sql('SELECT title,id \
             FROM  Title \
             WHERE id = 597 ',
            db).head(2)

     title   id
0  Titanic  597

In [83]:
pd.read_sql('SELECT COUNT(DISTINCT name) FROM  Belongs_to_Collection',
            db)

   COUNT(DISTINCT name)
0                     9